输入图片大小 W×W               300 * 300
卷积核大小 F×F                 3 * 3
步长 S                        1
padding的像素数 P              0
于是我们可以得出计算公式为：
N = (W − F + 2P )/S+1        N = (300 - 3 + 0) / 1 + 1


CNN
模型结构

Found 272 files belonging to 10 classes.
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
rescaling (Rescaling)        (None, 300, 300, 3)       0
_________________________________________________________________
conv2d (Conv2D)              (None, 298, 298, 32)      896
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 149, 149, 32)      0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 147, 147, 64)      18496
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 73, 73, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 71, 71, 128)       73856
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 35, 35, 128)       0
_________________________________________________________________
flatten (Flatten)            (None, 156800)            0
_________________________________________________________________
dense (Dense)                (None, 128)               20070528
_________________________________________________________________
dropout (Dropout)            (None, 128)               0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                1290
=================================================================
Total params: 20,165,066
Trainable params: 20,165,066
Non-trainable params: 0
_________________________________________________________________





ResNet152v2

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
rescaling (Rescaling)        (None, 300, 300, 3)       0
_________________________________________________________________
resnet152v2 (Functional)     (None, 10, 10, 2048)      58331648
_________________________________________________________________
global_average_pooling2d (Gl (None, 2048)              0
_________________________________________________________________
dense (Dense)                (None, 10)                20490
=================================================================
Total params: 58,352,138
Trainable params: 20,490
Non-trainable params: 58,331,648
_________________________________________________________________